LEXICON = {
    "welcome": "Добро пожаловать в игру «Угадай число»! Чтобы узнать правила игры жми на кнопку или напиши /help",
    "rules": "Компьютер случайно загадывает число в указанном вами диапазоне. Вам надо за определенное "
    "время и количество попыток угадать это число. Если вы не угадываете число, то компьютер дает "
    "вам подсказку(вышлет сообщение) о том, что загаданное число больше или меньше указанного "
    "вами. Если время истекло, вы проиграли, получите сообщение от бота, что игра проиграна. "
    "Если вы превысили количество попыток, то также получите сообщение, что игра "
    "проиграна. Игра считается выигранной, если вы угадали число до указанного "
    "времени и до указанного количества попыток. По проведенным играм ведется "
    "статистика сколько выиграно игр и сколько проиграно, сколько не закончено. Статистика "
    "доступна по соответствующей кнопке. Ваши настройки доступны по кнопке «Настройка игры».",
    "settings": "Настройка игры задается кнопками. Если вы еще не закончили игру, то текущая игра будет прервана.",
    "my_settings": "Вами установлены следующие настройки:  Диапазон чисел — от {range_start} до {range_end}, время игры - {time_limit} сек, количество попыток - {attempts}.",
    "set_range_prompt": "Задай диапазон чисел, напиши, например, так: «10 30» (без кавычек)",
    "set_time_prompt": "Ограничение по времени задается в секундах, напиши просто количество секунд, например «30» (без кавычек)",
    "set_attempts_prompt": "Установите количество попыток",
    "set_range_success": "Диапазон чисел установлен.",
    "set_attempts_success": "Количество попыток установлено.",
    "set_time_success": "Таймер игры установлен.",
    "set_range_error": "Неверный формат. Пожалуйста, введите диапазон чисел в формате «10 30» (без кавычек).",
    "set_time_error": "Неверный формат. Пожалуйста, введите число.",
    "set_attempts_error": "Неверный формат. Пожалуйста, введите число.",
    "missing_settings": "Не указаны настройки — {missing_settings}. Пожалуйста, укажите",
    "play_prompt": "Осталось попыток — {attempts_left}. Введите число.",
    "game_lost_time": "Игра проиграна, прошло указанное вами — {time_limit} секунд.",
    "interrupt": "Игра прервана. Установите новые настройки игры.",
    "out_game": "Вы не в игре. Нажмите на кнопку 'Играть'.",
    "only_numbers": "Неверный формат. Вы можете отправить мне только числа.",
    "my_number_is_higher": "Мое число больше. Осталось попыток — {attempts_left}. Введите число.",
    "my_number_is_less": "Мое число меньше. Осталось попыток — {attempts_left}. Введите число.",
    "won_game": "Вы победили! Прошло (указать количество секунд, которые прошли от начала игры) секунд и (указать сколько прошло попыток) попыток"

}
